---
kind: property
id: P:Autodesk.Revit.DB.ScheduleField.IsHidden
source: html/ee90c427-f957-515b-8d93-252b9da0a40d.htm
---
# Autodesk.Revit.DB.ScheduleField.IsHidden Property

Indicates if the field is hidden in the schedule.

## Syntax (C#)
```csharp
public bool IsHidden { get; set; }
```

## Remarks
A hidden field is not displayed in the schedule, but it can be used for
 filtering, sorting, grouping, and conditional formatting and can be
 referenced by Formula and Percentage fields.